
* TODO Load dae vertex colors

* TODO Item system                                                    :items:
* TODO Proc Trees                                                   :procgen:
* TODO [#A] Instance rendering for ground debris             :perf:rendering:
* TODO Simple pthreads job system                              :jobs:threads:

* Run pose                                                             :anim:
:LOGBOOK:
CLOCK: [2019-07-05 Fri 09:28]--[2019-07-05 Fri 09:28] =>  0:00
:END:


* TODO Initial physics system                                       :physics:
* TODO Entity loading stress test                                      :perf:

* TODO Infinite terrain                                             :terrain:


* TODO [#C] Half edge subdivision for tessellation        :terrain:rendering:
* TODO [#C] Procedural animation?                                      :anim:
* TODO Windows build                                                :windows:

* DONE Initial animation system
CLOSED: [2019-06-22 Sat 12:52]
* DONE Load poses in engine
CLOSED: [2019-06-22 Sat 12:52]

* DONE use nodes for joints
CLOSED: [2019-06-30 Sun 17:26]

It will just be easier for interpolation

* DONE quickhull tests
CLOSED: [2019-04-12 Fri 09:37]

* DONE Initial debris on ground
CLOSED: [2019-07-04 Thu 13:54]

To create a sense of movement

* DONE [#B] Load bone weights                                          :anim:
CLOSED: [2019-07-08 Mon 10:34]
:LOGBOOK:
CLOCK: [2019-07-08 Mon 10:34]--[2019-07-08 Mon 10:34] =>  0:00
CLOCK: [2019-07-05 Fri 15:46]--[2019-07-05 Fri 23:46] =>  8:00
:END:
